tap "clojure/tools"
tap "gromgit/fuse"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "kitproj/junit2html", "https://github.com/kitproj/junit2html"
tap "localstack/tap"
tap "mongodb/brew"
tap "vertx-distrib/tap"
brew "openssl@3"
brew "xz"
brew "allure"
brew "antigen"
brew "boost"
brew "python@3.10"
brew "asciidoc"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "libssh2"
brew "bat"
brew "btop"
brew "pycparser"
brew "cffi"
brew "conda-zsh-completion"
brew "coreutils"
brew "corkscrew"
brew "cpufetch"
brew "libidn2"
brew "curl"
brew "dasel"
brew "docutils"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "entr"
brew "wxwidgets"
brew "erlang"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gitleaks"
brew "unbound"
brew "gnutls"
brew "go"
brew "helix"
brew "helm"
brew "htop"
brew "jdtls"
brew "openjdk@17"
brew "jmeter"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "libassuan"
brew "lastpass-cli"
brew "leiningen"
brew "libice"
brew "libsm"
brew "libxt"
brew "libxmu"
brew "lighttpd"
brew "llvm"
brew "maven"
brew "minikube"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node@14"
brew "nvm"
brew "openjdk@11"
brew "opentofu"
brew "perl"
brew "plenv"
brew "pyenv"
brew "python@3.9"
brew "qemu"
brew "rabbitmq"
brew "ranger"
brew "ripgrep"
brew "rust"
brew "selenium-server"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "sonar-scanner"
brew "starship"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vim"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yq"
brew "zlib"
brew "zoxide"
brew "clojure/tools/clojure"
brew "gromgit/fuse/s3fs-mac"
brew "jesseduffield/lazygit/lazygit"
brew "kitproj/junit2html/junit2html"
brew "localstack/tap/localstack-cli"
brew "mongodb/brew/mongodb-database-tools"
brew "vertx-distrib/tap/vertx4"
cask "altair-graphql-client"
cask "chromedriver"
cask "github"
cask "iterm2"
cask "macfuse"
cask "miniconda"
cask "mongodb-compass"
cask "obsidian"
cask "postman"
cask "postman-cli"
cask "rectangle"
cask "shortcat"
cask "vagrant"
