tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "nikitabobko/tap"
brew "bash"
brew "bat"
brew "chezmoi"
brew "fd"
brew "fzf"
brew "git"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "thefuck"
brew "tree"
brew "zsh"
cask "font-jetbrains-mono-nerd-font"
