tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "retronym/formulas"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Kubernetes package manager
brew "helm"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Small memory footprint, flexible web-server
brew "lighttpd"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line collection runner for Postman
brew "newman"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@8"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Display the PID number for a given process name
brew "pidof"
# Draw UML diagrams
brew "plantuml"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Process YAML documents from the CLI - Version 3
brew "yq@3"
# Diff tool for Java classes or classpaths
brew "retronym/formulas/jardiff"
# OpenJDK distribution from Amazon
cask "corretto11"
cask "qlstephen"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source version of the X.Org X Window System
cask "xquartz"
