tap "benjiwolff/neovim-nightly"
tap "daveshanley/vacuum"
tap "deskflow/tap"
tap "felixkratz/formulae"
tap "grishka/grishka"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "speakeasy-api/tap"
tap "yakitrak/yakitrak"
brew "xz"
brew "readline"
brew "automake"
brew "openssl@3"
brew "libyaml"
brew "awscli-local"
brew "bash"
brew "bat"
brew "bison"
brew "bitwarden-cli"
brew "btop"
brew "carapace"
brew "certbot"
brew "chruby"
brew "coreutils"
brew "dasel"
brew "dict"
brew "diff-so-fancy"
brew "docx2txt"
brew "fd"
brew "ffmpeg"
brew "gawk"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "ipython"
brew "jj"
brew "jq"
brew "jsonlint"
brew "jupyterlab"
brew "lazygit"
brew "libffi"
brew "llvm"
brew "lua-language-server"
brew "mas"
brew "maven"
brew "nginx"
brew "nushell"
brew "ollama"
brew "opentofu"
brew "pillow"
brew "pkl"
brew "pngpaste"
brew "prettier"
brew "protobuf"
brew "protoc-gen-grpc-swift"
brew "ranger"
brew "ripgrep"
brew "slides"
brew "stylua"
brew "thefuck"
brew "tig"
brew "vale"
brew "vivid"
brew "wget"
brew "wordnet"
brew "zellij"
brew "zsh"
brew "daveshanley/vacuum/vacuum"
brew "felixkratz/formulae/sketchybar"
brew "qmk/qmk/qmk"
brew "speakeasy-api/tap/speakeasy"
brew "yakitrak/yakitrak/obsidian-cli"
cask "aerospace"
cask "charles"
cask "deskflow"
cask "equinox"
cask "font-caskaydia-cove-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "freecad"
cask "gimp"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "keymapp"
cask "kiro"
cask "kitty"
cask "libreoffice"
cask "neardrop"
cask "neovim-nightly"
cask "obsidian"
cask "postman"
cask "qlmarkdown"
cask "qmk-toolbox"
cask "rancher"
cask "rectangle"
cask "scoot"
cask "shortcat"
cask "vlc"
cask "vscodium"
cask "webex"
cask "zed"
mas "Keynote", id: 409183694
mas "Quiver", id: 866773894
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "asvetliakov.vscode-neovim"
vscode "folke.vscode-monorepo-workspace"
vscode "hverlin.mise-vscode"
vscode "redhat.java"
vscode "tamasfe.even-better-toml"
vscode "vercel.turbo-vsc"
vscode "vitest.explorer"
