tap "benjiwolff/neovim-nightly"
tap "daveshanley/vacuum"
tap "deskflow/tap"
tap "felixkratz/formulae"
tap "grishka/grishka"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "act"
brew "aerc"
brew "automake"
brew "awscli-local"
brew "azure-cli"
brew "bash"
brew "bat"
brew "btop"
brew "freetype"
brew "carapace"
brew "coreutils"
brew "dasel"
brew "dict"
brew "diff-so-fancy"
brew "direnv"
brew "doctl"
brew "docx2txt"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "glab"
brew "glow"
brew "gnu-sed"
brew "graphviz"
brew "hadolint"
brew "pkgconf"
brew "hf"
brew "htop"
brew "imagemagick"
brew "ipython"
brew "jless"
brew "jq"
brew "jsonlint"
brew "jupyterlab"
brew "just"
brew "k9s"
brew "kind"
brew "lazydocker"
brew "lazygit"
brew "lua-language-server"
brew "luajit"
brew "mas"
brew "moreutils"
brew "nbdime"
brew "neomutt"
brew "neovim"
brew "nginx"
brew "nmap"
brew "nushell"
brew "ollama"
brew "openapi-generator"
brew "ripgrep"
brew "opencode"
brew "opentofu"
brew "pillow"
brew "pkl"
brew "pngpaste"
brew "podman"
brew "podman-tui"
brew "prettier"
brew "protobuf"
brew "protoc-gen-grpc-swift"
brew "rancher-cli"
brew "ranger"
brew "rumdl"
brew "semgrep"
brew "sevenzip"
brew "slides"
brew "stylua"
brew "tectonic"
brew "thefuck"
brew "tig"
brew "tmux"
brew "uv"
brew "vale"
brew "vips"
brew "vivid"
brew "wget"
brew "wireshark"
brew "wordnet"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "android-file-transfer"
cask "caffeine"
cask "charles"
cask "claude-code"
cask "cursor"
cask "cursor-cli"
cask "font-geist-mono-nerd-font"
cask "font-hasklug-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "keymapp"
cask "leader-key"
cask "libreoffice"
cask "obsidian"
cask "postman"
cask "scoot"
cask "shortcat"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
vscode "anysphere.remote-ssh"
vscode "esbenp.prettier-vscode"
vscode "gitlab.gitlab-workflow"
vscode "ms-playwright.playwright"
vscode "nrwl.angular-console"
vscode "vscodevim.vim"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "cmd/go"
go "github.com/abice/go-enum"
go "cmd/gofmt"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
cargo "du-dust"
cargo "eza"
cargo "taplo-cli"
cargo "typst-cli"
cargo "wordnet-ls"
uv "mempalace"
npm "@mermaid-js/mermaid-cli"
npm "@sm/cli"
npm "corepack"
