tap "benjiwolff/neovim-nightly"
tap "daveshanley/vacuum"
tap "deskflow/tap"
tap "felixkratz/formulae"
tap "grishka/grishka"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "siderolabs/tap"
tap "speakeasy-api/tap"
tap "yakitrak/yakitrak"
brew "act"
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "xz"
brew "ansible"
brew "automake"
brew "awscli-local"
brew "bash"
brew "bat"
brew "bison"
brew "bitwarden-cli"
brew "btop"
brew "freetype"
brew "carapace"
brew "certbot"
brew "chruby"
brew "coreutils"
brew "dasel"
brew "dict"
brew "diff-so-fancy"
brew "direnv"
brew "docx2txt"
brew "fd"
brew "ffmpeg"
brew "gawk"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "imagemagick"
brew "ipython"
brew "jj"
brew "jq"
brew "jsonlint"
brew "jupyterlab"
brew "just"
brew "k9s"
brew "kind"
brew "lazygit"
brew "libffi"
brew "llvm"
brew "lua-language-server"
brew "mas"
brew "maven"
brew "nbdime"
brew "neovim", link: false
brew "nginx"
brew "nushell"
brew "ollama"
brew "opentofu"
brew "pillow"
brew "pkgconf"
brew "pkl"
brew "pngpaste"
brew "prettier"
brew "protobuf"
brew "protoc-gen-grpc-swift"
brew "ranger"
brew "ripgrep"
brew "rumdl"
brew "slides"
brew "stylua"
brew "tectonic"
brew "terraform"
brew "thefuck"
brew "tig"
brew "uv"
brew "vale"
brew "vivid"
brew "wget"
brew "wireshark"
brew "wordnet"
brew "yq"
brew "zellij"
brew "zsh"
brew "daveshanley/vacuum/vacuum"
brew "felixkratz/formulae/sketchybar"
brew "qmk/qmk/qmk"
brew "siderolabs/tap/talosctl"
brew "speakeasy-api/tap/speakeasy"
brew "yakitrak/yakitrak/obsidian-cli"
cask "aerospace"
cask "android-file-transfer"
cask "bitwarden"
cask "blackhole-2ch"
cask "charles"
cask "claude"
cask "claude-code"
cask "deskflow"
cask "equinox"
cask "font-caskaydia-cove-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "freecad"
cask "gimp"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "keepassxc"
cask "keymapp"
cask "kitty"
cask "libreoffice"
cask "neardrop"
cask "obs"
cask "obsidian"
cask "postman"
cask "qlmarkdown"
cask "qmk-toolbox"
cask "rancher"
cask "rectangle"
cask "scoot"
cask "shortcat"
cask "signal"
cask "vlc"
cask "vscodium"
cask "webex"
cask "wireshark-app"
cask "zed"
mas "Keynote", id: 409183694
mas "Quiver", id: 866773894
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "denoland.vscode-deno"
vscode "folke.vscode-monorepo-workspace"
vscode "hverlin.mise-vscode"
vscode "redhat.java"
vscode "tamasfe.even-better-toml"
vscode "vercel.turbo-vsc"
vscode "vitest.explorer"
vscode "vscodevim.vim"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "cmd/go"
go "github.com/abice/go-enum"
go "cmd/gofmt"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
go "golang.org/x/tools/cmd/stringer"
